Revit 2024 API
ModelLine Class
Represents a ModelLine within Autodesk Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class ModelLine : ModelCurve
Visual Basic
Public Class ModelLine _
	Inherits ModelCurve
Visual C++
public ref class ModelLine : public ModelCurve
Remarks
Geometry-related functionality is provided by the geometry curve object from the ModelCurve::geometryCurve property.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CurveElement
 Autodesk.Revit.DB.ModelCurve
 Autodesk.Revit.DB.ModelLine
See Also
ModelLine Members
Autodesk.Revit.DB Namespace